Bunkering_01/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 101325;

boundaryField
{
    right               { type zeroGradient;}
    left                { type zeroGradient;}
    front               { type zeroGradient;}
    back                { type fixedValue; value $internalField;}
    top                 { type zeroGradient;}
    bottom              { type fixedFluxPressure;}
    bunkering-boat_m    { type fixedFluxPressure;}
    bunkering-quay_m    { type fixedFluxPressure;}
    nozzle_holder_wall  { type fixedFluxPressure;}
    nozzle              { type zeroGradient; }
}
// ************************************************************************* //
